#include "pattern.h"	//패턴 헤더 호출
#include <stdio.h>

//총 8 형태의 - 과 ■ 의 조합이 배열된 패턴들

void p0()			//패턴 0 (처음 시작 & 노트의 마지막)
{
	printf("- - - - - - -] [- - - - - - -");
}

void p1()			//패턴 1 (첫 번째)
{
	printf("■ - - - - - -] [- - - - - - ■");
}

void p2()			//패턴 2 (두 번째)
{
	printf("- ■ - - - - -] [- - - - - ■ -");
}

void p3()			//패턴 3 (세 번째)
{
	printf("- - ■ - - - -] [- - - - ■ - -");
}

void p4()			//패턴 4 (네 번째)
{
	printf("- - - ■ - - -] [- - - ■ - - -");
}

void p5()			//패턴 5 (다섯 번째)
{
	printf("- - - - ■ - -] [- - ■ - - - -");
}

void p6()			//패턴 6 (여섯 번째)
{
	printf("- - - - - ■ -] [- ■ - - - - -");
}

void p7()			//패턴 7 (일곱 번째)
{
	printf("- - - - - - ■] [■ - - - - - -");
}
